01_Relatorios_e_Dashboard/DASHBOARD_VISUAL.md
```mermaid
sequenceDiagram
    autonumber
    participant A as :Aluno
    participant S as :MD_Simulado
    A->>S: iniciarTeste()
    activate S
    S-->>A: listaQuestoes[]
    A->>S: enviarRespostas()
    S-->>A: notaFinal
    deactivate S
    A->>A: definirFaseInicial(nota)
```
