PIM_III/02_Modelagem_UML_Astah/UC03_Realizar_Teste_Nivelamento/UC03_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant A as ":Aluno"
participant S as ":Simulado"
A -> S : iniciarTeste()
activate S
S --/ A : listaQuestoes[]
A -> S : enviarRespostas()
S --/ A : notaFinal
deactivate S
A -> A : definirFaseInicial(nota)
@enduml
