PIM_III/03_Artefatos_Gerados/UC06_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant T as ":Tutor"
participant D as ":PainelVisual"
participant A as ":MD_Alunos"
T -> D : visualizar(id)
activate D
D -> A : obterMetricas()
A --/ D : dados
D --/ T : Relatório Visual
deactivate D
@enduml
