03_Artefatos_Gerados/UC09_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant A as ":Aluno"
participant M as ":MD_MotorSM2"
participant F as ":MD_Flashcards"
A -> F : lerPergunta()
A -> M : informarDificuldade(1-5)
M -> M : aplicarSM2()
M -> F : setProximaRevisao(data)
F --/ A : Ok
@enduml
