03_Artefatos_Gerados/UC10_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant A as ":Aluno"
participant E as ":Editor"
participant F as ":MD_Flashcards"
A -> E : entrada(p, r)
E -> F : <<create>>(p, r)
F --/ A : Sucesso
@enduml
