PIM_III/03_Artefatos_Gerados/UC12_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant S as ":Sistema"
participant G as ":MD_Gamificacao"
participant A as ":MD_Alunos"
S -> G : concluirTarefa()
G -> G : calcular()
G -> A : creditarXP(100)
G --/ S : Ok
@enduml
