03_Artefatos_Gerados/UC14_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant Al as ":Aluno"
participant D as ":PainelVisual"
Al -> D : abrirHome()
D -> D : renderizar()
D --/ Al : Ok
@enduml
